Simasjid_Web/app/Models/ModelAgenda.php

SELECT *
FROM `tb_agenda`
---
    public function AllData()
    {
        return $this->db->table('tb_agenda')
            ->get()->getResultArray();