Simasjid_Web/app/Models/ModelLogin.php

    public function CekUser($email){
        return $this->db->table('tb_users')
        ->where('email', $email)
        ->get()->getRowArray();
---
SELECT *
FROM `tb_users`
WHERE `email` = 'admin@gmail.com'