Simasjid_Web/app/Models/ModelNikah.php

SELECT *
FROM `tb_nikah`
---
    public function AllData()
    {
        return $this->db->table('tb_nikah')
            ->get()->getResultArray();