Simasjid_Web/app/Models/ModelKasMasjid.php

    public function AllData()
    {
        return $this->db->table('tb_kas')->orderBy('tanggal', 'DESC')
            ->get()->getResultArray();
---
SELECT *
FROM `tb_kas`
ORDER BY `tanggal` DESC