Simasjid_Web/app/Models/ModelPesertaQurban.php

    public function AllDataLaporanPribadi($id_tahun)
    {
        return $this->db->table('tb_peserta_pribadi')
            ->join('tb_tahun', 'tb_peserta_pribadi.id_tahun = tb_tahun.id_tahun')
            ->where('tb_tahun.id_tahun', $id_tahun)
            ->get()->getResultArray();
---
SELECT *
FROM `tb_peserta_pribadi`
JOIN `tb_tahun` ON `tb_peserta_pribadi`.`id_tahun` = `tb_tahun`.`id_tahun`
WHERE `tb_tahun`.`id_tahun` = '9'

    public function AllDataLaporanKelompok($id_tahun)
    {
        return $this->db->table('tb_peserta_kelompok')
            ->join('tb_kelompok_qurban', 'tb_peserta_kelompok.id_kelompok = tb_kelompok_qurban.id_kelompok')
            ->join('tb_tahun', 'tb_kelompok_qurban.id_tahun = tb_tahun.id_tahun')
            ->where('tb_tahun.id_tahun', $id_tahun)
            ->select('tb_peserta_kelompok.*, tb_kelompok_qurban.nama_kelompok')
            ->get()->getResultArray();
---
SELECT `tb_peserta_kelompok`.*, `tb_kelompok_qurban`.`nama_kelompok`
FROM `tb_peserta_kelompok`
JOIN `tb_kelompok_qurban` ON `tb_peserta_kelompok`.`id_kelompok` = `tb_kelompok_qurban`.`id_kelompok`
JOIN `tb_tahun` ON `tb_kelompok_qurban`.`id_tahun` = `tb_tahun`.`id_tahun`
WHERE `tb_tahun`.`id_tahun` = '9'