Simasjid_Web/app/Models/ModelTahun.php

    public function AllData()
    {
        return $this->db->table('tb_tahun')
            ->get()->getResultArray();
---
SELECT *
FROM `tb_tahun`