Simasjid_Web/app/Models/ModelAdmin.php

SELECT *
FROM `tb_setting`
WHERE `id` = 1
---
    public function ViewSetting(){
        return $this->db->table('tb_setting')
        ->where('id', 1)
        ->get()->getRowArray();